feat: :sparkles: Update HMT-TSF architecture diagram
